In [1]:
import pandas as pd

# Introduction

In this lab we want you to learn and investigate some concepts in the context of Pandas: **concatenating**, **joining**, and **merging**. We want to review these concepts because it will make the subsequent work in transforming the datasets a lot more efficient.

# Concatenating, Joining, & Merging Tutorial


## Concatenating

Concatenating two dataframes combines two dataframes so that we append the rows of one dataframe at the end of the other. Our column names have to be identical for this function to work properly.

Below is an example of the `concat()` function in pandas

https://pandas.pydata.org/docs/reference/api/pandas.concat.html

In [2]:
df1 = pd.DataFrame({'A': ['a'+str(x) for x in range(3)],
                    'B': ['b'+str(x) for x in range(3)],
                    'C': ['c'+str(x) for x in range(3)]},
                     index=[0, 1, 2])

df2 = pd.DataFrame({'A': ['a'+str(x) for x in range(3, 6)],
                    'B': ['b'+str(x) for x in range(3, 6)],
                    'C': ['c'+str(x) for x in range(3, 6)]},
                     index=[3, 4, 5]) 

df3 = pd.DataFrame({'D': ['d'+str(x) for x in range(3)],
                    'E': ['e'+str(x) for x in range(3)],
                    'F': ['f'+str(x) for x in range(3)]},
                     index=[0, 1, 2]) 

df4 = pd.DataFrame({'D': ['d'+str(x) for x in range(3, 6)],
                    'E': ['e'+str(x) for x in range(3, 6)],
                    'F': ['f'+str(x) for x in range(3, 6)]},
                     index=[3, 4, 5]) 

# print(df1, '\n---\n', df2, '\n---\n', df3, '\n---\n',df4)

Let's try concatenating `df1` and `df2`, as well as `df3` and `df4`.

In [3]:
concat_1 = pd.concat([df1, df2], axis=0)
display(concat_1)

concat_2 = pd.concat([df3,df4], axis=0)
display(concat_2)

    A   B   C
0  a0  b0  c0
1  a1  b1  c1
2  a2  b2  c2
3  a3  b3  c3
4  a4  b4  c4
5  a5  b5  c5

    D   E   F
0  d0  e0  f0
1  d1  e1  f1
2  d2  e2  f2
3  d3  e3  f3
4  d4  e4  f4
5  d5  e5  f5

From the output above, you see the second dataframe is appended at the bottom of the first dataframe.

Now let's try concatenating `df1`, `df2`, `df3`, and `df4` all together.

Note that the `sort=False` param is supplied to silence a warning message on a future Pandas change. It does not make any difference on the output.

In [4]:
# Concat in the rows
concat_3 = pd.concat([concat_1, concat_2], axis=0)
display(concat_3)

# Concat in the columns join same index of each table in the new column
concat_4 = pd.concat([concat_1, concat_2], axis=1)
display(concat_4)

     A    B    C    D    E    F
0   a0   b0   c0  NaN  NaN  NaN
1   a1   b1   c1  NaN  NaN  NaN
2   a2   b2   c2  NaN  NaN  NaN
3   a3   b3   c3  NaN  NaN  NaN
4   a4   b4   c4  NaN  NaN  NaN
5   a5   b5   c5  NaN  NaN  NaN
0  NaN  NaN  NaN   d0   e0   f0
1  NaN  NaN  NaN   d1   e1   f1
2  NaN  NaN  NaN   d2   e2   f2
3  NaN  NaN  NaN   d3   e3   f3
4  NaN  NaN  NaN   d4   e4   f4
5  NaN  NaN  NaN   d5   e5   f5

    A   B   C   D   E   F
0  a0  b0  c0  d0  e0  f0
1  a1  b1  c1  d1  e1  f1
2  a2  b2  c2  d2  e2  f2
3  a3  b3  c3  d3  e3  f3
4  a4  b4  c4  d4  e4  f4
5  a5  b5  c5  d5  e5  f5

What do we find?

* Pandas' `concat` method respects indexes of all axes. 
    * Because `df3` and `df4` have different column indexes than `df1` and `df2`, `concat` put them into different columns. 
    * `df3` and `df4` also retain their original row indexes of 0-5 instead of continuing from the last index of `df2`. 
* `concat` creates `NaN` at places where values are missing.

Try also supplying `ignore_index=True` to `concat`. How is the output different?

In [5]:
# Concat in the rows ignoring the axis
concat_5 = pd.concat([concat_1, concat_2], axis=0, ignore_index=True)
display(concat_5)

      A    B    C    D    E    F
0    a0   b0   c0  NaN  NaN  NaN
1    a1   b1   c1  NaN  NaN  NaN
2    a2   b2   c2  NaN  NaN  NaN
3    a3   b3   c3  NaN  NaN  NaN
4    a4   b4   c4  NaN  NaN  NaN
5    a5   b5   c5  NaN  NaN  NaN
6   NaN  NaN  NaN   d0   e0   f0
7   NaN  NaN  NaN   d1   e1   f1
8   NaN  NaN  NaN   d2   e2   f2
9   NaN  NaN  NaN   d3   e3   f3
10  NaN  NaN  NaN   d4   e4   f4
11  NaN  NaN  NaN   d5   e5   f5

If we concatenate on the axis 0, the index should be duplicated, which is solved using ignore_index. With this parameter, the indexes are reset.

## Merging and Joining

Pandas has two functions for joining datasets: `merge()` and `join()`. They perform the same task but have different options and syntax. 

Below is an example of `merge` and `join`.     
HINT (uses the column that repeats in both dataframes )

https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.merge.html

In [6]:
left = pd.DataFrame({'idx': ['i'+str(x) for x in range(3)],
                     'A': ['a'+str(x) for x in range(3)],
                     'B': ['b'+str(x) for x in range(3)]})


right = pd.DataFrame({'idx': ['i'+str(x) for x in range(1,4)],
                     'C': ['c'+str(x) for x in range(1,4)],
                     'D': ['d'+str(x) for x in range(1,4)]})

In [7]:
left

  idx   A   B
0  i0  a0  b0
1  i1  a1  b1
2  i2  a2  b2

In [8]:
right

  idx   C   D
0  i1  c1  d1
1  i2  c2  d2
2  i3  c3  d3

`join` is identical to `merge`. But when using join, we need to explicitly set the index column of the dataframes to join using `set_index`:

https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.join.html

In [9]:
default_merge = left.merge(right, how="inner")
display(default_merge)

default_join = left.join(right.set_index("idx"), on = "idx", how="inner")
display(default_join)

inner_merge_with_index = pd.merge(left, right, how="inner", on='idx')
display(inner_merge_with_index)

left_merge_with_index = left.merge(right, how="left", left_on='idx', right_on='idx')
display(left_merge_with_index)

right_merge_with_index = left.merge(right, how="right", left_on='idx', right_on='idx')
display(right_merge_with_index)

outer_merge = left.merge(right, how="outer")
display(outer_merge)

  idx   A   B   C   D
0  i1  a1  b1  c1  d1
1  i2  a2  b2  c2  d2

  idx   A   B   C   D
1  i1  a1  b1  c1  d1
2  i2  a2  b2  c2  d2

  idx   A   B   C   D
0  i1  a1  b1  c1  d1
1  i2  a2  b2  c2  d2

  idx   A   B    C    D
0  i0  a0  b0  NaN  NaN
1  i1  a1  b1   c1   d1
2  i2  a2  b2   c2   d2

  idx    A    B   C   D
0  i1   a1   b1  c1  d1
1  i2   a2   b2  c2  d2
2  i3  NaN  NaN  c3  d3

  idx    A    B    C    D
0  i0   a0   b0  NaN  NaN
1  i1   a1   b1   c1   d1
2  i2   a2   b2   c2   d2
3  i3  NaN  NaN   c3   d3

And you see, `join` disregards the row of `right` with the unmatching index `i3`. It retains the row of `left` with the unmatching index `i0` but uses `NaN` for the missing data after joining.

#### There are other options we can explore with the `merge()` and `join()` functions. 

Specifically, we can specify `how`. This argument in the function tells us whether we are performing an inner, left, right, or outer join.

We can also specify a different column for joining in the `merge()` function using the `left_on` and `right_on` arguments. Check out the following documentations if you want to explore more:

[pandas.DataFrame.merge](https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.merge.html)

[pandas.DataFrame.join](https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.join.html)

## Example real use case with join

In [10]:
import pandas as pd

# 1. Huge Transactions Table (The "Left")
transactions = pd.DataFrame({
    'transaction_id': [101, 102, 103],
    'product_id': [5, 5, 8],
    'store_id': [1, 2, 1],
    'amount': [150.00, 150.00, 300.00]
})

# 2. Reference Tables (The "Right" tables) - Keys are set as INDEX
products = pd.DataFrame({
    'name': ['Laptop', 'Mouse'],
    'category': ['Tech', 'Tech']
}, index=[5, 8])  # product_id is the index

stores = pd.DataFrame({
    'location': ['New York', 'London'],
    'manager': ['Alice', 'Bob']
}, index=[1, 2])  # store_id is the index

In [11]:
display(transactions)
display(products)
display(stores)

# Clean and fast: Joining two reference tables at once onto the transactions
final_report = transactions.join(products, on='product_id').join(stores, on='store_id')
display(final_report)

   transaction_id  product_id  store_id  amount
0             101           5         1   150.0
1             102           5         2   150.0
2             103           8         1   300.0

     name category
5  Laptop     Tech
8   Mouse     Tech

   location manager
1  New York   Alice
2    London     Bob

,transaction_id,product_id,store_id,amount,name,category,location,manager
0,101,5,1,150.0,Laptop,Tech,New York,Alice
1,102,5,2,150.0,Laptop,Tech,London,Bob
2,103,8,1,300.0,Mouse,Tech,New York,Alice

## Same Example using merge

In [12]:
# You have to repeat the function call over and over
step1 = transactions.merge(products, left_on='product_id', right_index=True)
final_report = step1.merge(stores, left_on='store_id', right_index=True)
display(final_report)

,transaction_id,product_id,store_id,amount,name,category,location,manager
0,101,5,1,150.0,Laptop,Tech,New York,Alice
1,102,5,2,150.0,Laptop,Tech,London,Bob
2,103,8,1,300.0,Mouse,Tech,New York,Alice

When you have tables that represent objects, like products in a store, the most natural way of joining the tables is using the "join". The joining happens using the indexes. In addition to that, this method is generally faster than using "merge". For other cases, is more natural to join tables matching the contents of the columns using "merge" which is the most frequent case.

## Bonus Question

Now if you look back on `merge` and `join`, you realize that in order to perform these functions on a set of dataframes, these dataframes must share a common column as the index. Only rows that have the same index values will be joined. This is similar to the [`join` function in MySQL](https://www.w3schools.com/sql/sql_join.asp), isn't it?

The bonus question for you is to figure out how to join and concatenate `df1`, `df2`, `df3`, and `df4` we created at the beginning of this challenge. Your end product should look like this:

![df1-2-3-4.png](../images/df1-2-3-4.png)

In [13]:
# Merge and join

# display(df1)
# display(df2)
# display(df3)
# display(df4)

first_merge = df1.merge(df2, how="outer")
display(first_merge)

second_merge = df3.merge(df4, how="outer")
display(second_merge)

first_merge.join(second_merge)

    A   B   C
0  a0  b0  c0
1  a1  b1  c1
2  a2  b2  c2
3  a3  b3  c3
4  a4  b4  c4
5  a5  b5  c5

    D   E   F
0  d0  e0  f0
1  d1  e1  f1
2  d2  e2  f2
3  d3  e3  f3
4  d4  e4  f4
5  d5  e5  f5

    A   B   C   D   E   F
0  a0  b0  c0  d0  e0  f0
1  a1  b1  c1  d1  e1  f1
2  a2  b2  c2  d2  e2  f2
3  a3  b3  c3  d3  e3  f3
4  a4  b4  c4  d4  e4  f4
5  a5  b5  c5  d5  e5  f5

In [14]:
# Using only merge
display(df1)
display(df2)
# display(df3)
# display(df4)
first_merge = df1.merge(df2, how="outer")
display(first_merge)

second_merge = df3.merge(df4, how="outer")
display(second_merge)

first_merge.merge(second_merge, right_index=True, left_index=True)

    A   B   C
0  a0  b0  c0
1  a1  b1  c1
2  a2  b2  c2

    A   B   C
3  a3  b3  c3
4  a4  b4  c4
5  a5  b5  c5

    A   B   C
0  a0  b0  c0
1  a1  b1  c1
2  a2  b2  c2
3  a3  b3  c3
4  a4  b4  c4
5  a5  b5  c5

    D   E   F
0  d0  e0  f0
1  d1  e1  f1
2  d2  e2  f2
3  d3  e3  f3
4  d4  e4  f4
5  d5  e5  f5

    A   B   C   D   E   F
0  a0  b0  c0  d0  e0  f0
1  a1  b1  c1  d1  e1  f1
2  a2  b2  c2  d2  e2  f2
3  a3  b3  c3  d3  e3  f3
4  a4  b4  c4  d4  e4  f4
5  a5  b5  c5  d5  e5  f5

In [15]:
# using only join

display(df1)
display(df2)
# display(df3)
# display(df4)

first_join = df1.join(df3, how="inner")
display(first_join)

second_join = df2.join(df4, how="inner")
display(second_join)

first_join.merge(second_join, how="outer")

    A   B   C
0  a0  b0  c0
1  a1  b1  c1
2  a2  b2  c2

    A   B   C
3  a3  b3  c3
4  a4  b4  c4
5  a5  b5  c5

    A   B   C   D   E   F
0  a0  b0  c0  d0  e0  f0
1  a1  b1  c1  d1  e1  f1
2  a2  b2  c2  d2  e2  f2

    A   B   C   D   E   F
3  a3  b3  c3  d3  e3  f3
4  a4  b4  c4  d4  e4  f4
5  a5  b5  c5  d5  e5  f5

    A   B   C   D   E   F
0  a0  b0  c0  d0  e0  f0
1  a1  b1  c1  d1  e1  f1
2  a2  b2  c2  d2  e2  f2
3  a3  b3  c3  d3  e3  f3
4  a4  b4  c4  d4  e4  f4
5  a5  b5  c5  d5  e5  f5

## Conclusions about join and merge

It is possible to use only merge for all operations that include the joining of data frames from the index or the column.
The same cannot be said about the "join". In the previous example, the impossibility of joining data frames with different indexes,
prevent us from using it for all necessary operations. Thus, it was possible to observe the real nature of the "join", and when it could be
advantageous to use it.